# Pandas

## DataFrame

In [1]:
import pandas as pd

In [2]:
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})
print(frame)
frame = pd.read_csv('dataset.csv', header=0, sep=' ')
print(frame.columns)
print(frame.shape)
print(frame)

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a
Index(['Name', 'Birth', 'City', 'Position'], dtype='object')
(6, 4)
          Name       Birth     City  Position
Ivanov    A.A.  22.03.1980     Kyiv    driver
Petrovsk  I.V.  07.08.1965  Kharkiv  engineer
Boby      M.M.  13.02.1980     Lviv   manager
Melnyk    D.C.  15.04.1985    Odesa       NaN
Jonny     J.J.  19.11.1985  Poltava  engineer
Oskar     C.S.  31.05.1985     Kyiv    intern

In [3]:
# adding rows
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}
frame.append(new_line, ignore_index=True)
frame = frame.append(new_line, ignore_index=True)
print(frame)

    Name       Birth     City  Position
0   A.A.  22.03.1980     Kyiv    driver
1   I.V.  07.08.1965  Kharkiv  engineer
2   M.M.  13.02.1980     Lviv   manager
3   D.C.  15.04.1985    Odesa       NaN
4   J.J.  19.11.1985  Poltava  engineer
5   C.S.  31.05.1985     Kyiv    intern
6  Perov  22.03.1990    Penza       NaN

In [4]:
# adding column
frame['IsStudent'] = [False]*5 + [True]*2

In [5]:
# delete row
frame.drop([5,6], axis=0)
print(frame)

    Name       Birth     City  Position  IsStudent
0   A.A.  22.03.1980     Kyiv    driver      False
1   I.V.  07.08.1965  Kharkiv  engineer      False
2   M.M.  13.02.1980     Lviv   manager      False
3   D.C.  15.04.1985    Odesa       NaN      False
4   J.J.  19.11.1985  Poltava  engineer      False
5   C.S.  31.05.1985     Kyiv    intern       True
6  Perov  22.03.1990    Penza       NaN       True

In [6]:
frame.drop([5,6], axis=0, inplace=True)
print(frame)

   Name       Birth     City  Position  IsStudent
0  A.A.  22.03.1980     Kyiv    driver      False
1  I.V.  07.08.1965  Kharkiv  engineer      False
2  M.M.  13.02.1980     Lviv   manager      False
3  D.C.  15.04.1985    Odesa       NaN      False
4  J.J.  19.11.1985  Poltava  engineer      False

In [7]:
frame.drop('IsStudent', axis=1, inplace=True)
print(frame)

   Name       Birth     City  Position
0  A.A.  22.03.1980     Kyiv    driver
1  I.V.  07.08.1965  Kharkiv  engineer
2  M.M.  13.02.1980     Lviv   manager
3  D.C.  15.04.1985    Odesa       NaN
4  J.J.  19.11.1985  Poltava  engineer

In [8]:
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=False)

In [9]:
!cat updated_dataset.csv
# for Windows
#!more updated_dataset.csv

Name,Birth,City,Position
A.A.,22.03.1980,Kyiv,driver
I.V.,07.08.1965,Kharkiv,engineer
M.M.,13.02.1980,Lviv,manager
D.C.,15.04.1985,Odesa,
J.J.,19.11.1985,Poltava,engineer

In [10]:
frame = pd.read_csv('dataset.csv', header=0, sep=' ')
print(frame)
print(frame.dtypes)

          Name       Birth     City  Position
Ivanov    A.A.  22.03.1980     Kyiv    driver
Petrovsk  I.V.  07.08.1965  Kharkiv  engineer
Boby      M.M.  13.02.1980     Lviv   manager
Melnyk    D.C.  15.04.1985    Odesa       NaN
Jonny     J.J.  19.11.1985  Poltava  engineer
Oskar     C.S.  31.05.1985     Kyiv    intern
Name        object
Birth       object
City        object
Position    object
dtype: object

In [11]:
frame.Birth = frame.Birth.apply(pd.to_datetime)
print(frame)
print(frame.dtypes)

          Name      Birth     City  Position
Ivanov    A.A. 1980-03-22     Kyiv    driver
Petrovsk  I.V. 1965-07-08  Kharkiv  engineer
Boby      M.M. 1980-02-13     Lviv   manager
Melnyk    D.C. 1985-04-15    Odesa       NaN
Jonny     J.J. 1985-11-19  Poltava  engineer
Oskar     C.S. 1985-05-31     Kyiv    intern
Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [12]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Ivanov to Oskar
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    5 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 240.0+ bytes

In [13]:
frame.fillna('worker')

          Name      Birth     City  Position
Ivanov    A.A. 1980-03-22     Kyiv    driver
Petrovsk  I.V. 1965-07-08  Kharkiv  engineer
Boby      M.M. 1980-02-13     Lviv   manager
Melnyk    D.C. 1985-04-15    Odesa    worker
Jonny     J.J. 1985-11-19  Poltava  engineer
Oskar     C.S. 1985-05-31     Kyiv    intern

In [14]:
frame.fillna('worker', inplace=True)
print(frame)

          Name      Birth     City  Position
Ivanov    A.A. 1980-03-22     Kyiv    driver
Petrovsk  I.V. 1965-07-08  Kharkiv  engineer
Boby      M.M. 1980-02-13     Lviv   manager
Melnyk    D.C. 1985-04-15    Odesa    worker
Jonny     J.J. 1985-11-19  Poltava  engineer
Oskar     C.S. 1985-05-31     Kyiv    intern

In [15]:
print(frame.Position)
print(frame[['Position']])
print(frame[['Name', 'Position']])

Ivanov        driver
Petrovsk    engineer
Boby         manager
Melnyk        worker
Jonny       engineer
Oskar         intern
Name: Position, dtype: object
          Position
Ivanov      driver
Petrovsk  engineer
Boby       manager
Melnyk      worker
Jonny     engineer
Oskar       intern
          Name  Position
Ivanov    A.A.    driver
Petrovsk  I.V.  engineer
Boby      M.M.   manager
Melnyk    D.C.    worker
Jonny     J.J.  engineer
Oskar     C.S.    intern

In [16]:
print(frame[:3])
print(frame[-3:])

          Name      Birth     City  Position
Ivanov    A.A. 1980-03-22     Kyiv    driver
Petrovsk  I.V. 1965-07-08  Kharkiv  engineer
Boby      M.M. 1980-02-13     Lviv   manager
        Name      Birth     City  Position
Melnyk  D.C. 1985-04-15    Odesa    worker
Jonny   J.J. 1985-11-19  Poltava  engineer
Oskar   C.S. 1985-05-31     Kyiv    intern

In [18]:
frame.iloc[[1,3,5], [0,1]]

          Name      Birth
Petrovsk  I.V. 1965-07-08
Melnyk    D.C. 1985-04-15
Oskar     C.S. 1985-05-31

In [19]:
frame[frame.Birth >= pd.datetime(1985,1,1)]

        Name      Birth     City  Position
Melnyk  D.C. 1985-04-15    Odesa    worker
Jonny   J.J. 1985-11-19  Poltava  engineer
Oskar   C.S. 1985-05-31     Kyiv    intern

In [20]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) &
      (frame.City != 'Kyiv')]

        Name      Birth     City  Position
Melnyk  D.C. 1985-04-15    Odesa    worker
Jonny   J.J. 1985-11-19  Poltava  engineer
Oskar   C.S. 1985-05-31     Kyiv    intern

In [21]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) |
      (frame.City == 'Odesa')]

        Name      Birth     City  Position
Melnyk  D.C. 1985-04-15    Odesa    worker
Jonny   J.J. 1985-11-19  Poltava  engineer
Oskar   C.S. 1985-05-31     Kyiv    intern